In [18]:
import pandas as pd
pd.options.display.float_format = '{:,.2f}'.format #this adds commas and limits decimals to 2 places

In [19]:
df=pd.read_csv(r"C:\Users\jojuk\Documents\git\projects\Capstone\data\Capstone - Age and Sex at Admission Combined Years Clean.csv")

In [20]:
df.head(2)

,Grouping,Total,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,35 to 39 years,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 years and over,Unknown age,Year
0,Total All Classes,"81,563,139","1,430,271","2,315,233","2,836,873","3,618,339","5,616,480","7,945,692","8,777,437","8,205,852","7,812,450","7,736,403","7,039,259","6,056,084","4,781,297","7,386,155","5,314",2019
1,Total Students and Exchange Visitors,"2,527,655","16,645","28,419","38,323","374,015","1,090,004","542,766","236,804","96,963","49,093","27,238","13,975","7,333","3,508","2,504",65,2019

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 18 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Grouping           18 non-null     object
 1   Total              18 non-null     object
 2   Under 5 years      18 non-null     object
 3   5 to 9 years       18 non-null     object
 4   10 to 14 years     18 non-null     object
 5   15 to 19 years     18 non-null     object
 6   20 to 24 years     18 non-null     object
 7   25 to 29 years     18 non-null     object
 8   30 to 34 years     18 non-null     object
 9   35 to 39 years     18 non-null     object
 10  40 to 44 years     18 non-null     object
 11  45 to 49 years     18 non-null     object
 12  50 to 54 years     18 non-null     object
 13  55 to 59 years     18 non-null     object
 14  60 to 64 years     18 non-null     object
 15  65 years and over  18 non-null     object
 16  Unknown age        18 non-null     object
 17  Year               18 non-null     int64
dtypes: int64(1), object(17)
memory usage: 2.7+ KB

In [30]:
df.pivot_table('survived', index='Grouping', columns='25 to 29 years')

AttributeError: 'SeriesGroupBy' object has no attribute 'pivot_table'

In [28]:
df.groupby('Grouping')[['Total']].mean()

AttributeError: 'SeriesGroupBy' object has no attribute 'groupby'